GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Src/fm33lr0xx_fl_gptim.c
#define IS_FL_GPTIM_TRIGGER_SRC(__VALUE__)          (((__VALUE__) ==FL_GPTIM_TRGI_ITR0 )\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR1 )\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR2)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR3)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_TI1F_ED)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_TI1FP1)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_TI2FP2)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ETRF)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR4)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR5)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR6)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR7)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR8)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR9)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR10)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR11)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR12)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR13)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR14)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR15))


#define IS_FL_GPTIM_ETR_FILTER(__VALUE__)           (((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV1) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV1_N2) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV1_N4) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV1_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV2_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV2_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV4_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV4_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV8_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV8_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV16_N5) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV16_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV16_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV32_N5) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV32_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV32_N8))


#define IS_FL_GPTIM_ETR_PSC(__VALUE__)              (((__VALUE__) == FL_GPTIM_ETR_PSC_DIV1) ||\
                                                     ((__VALUE__) == FL_GPTIM_ETR_PSC_DIV2) ||\
                                                     ((__VALUE__) == FL_GPTIM_ETR_PSC_DIV4) ||\
                                                     ((__VALUE__) == FL_GPTIM_ETR_PSC_DIV8))

#define IS_FL_GPTIM_ETR_POLARITY(__VALUE__)         (((__VALUE__) == FL_GPTIM_ETR_POLARITY_NORMAL) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_POLARITY_INVERT))



#define IS_FL_GPTIM_IC_POLARITY(__VALUE__)          (((__VALUE__) == FL_GPTIM_IC_POLARITY_NORMAL) \
                                                       || ((__VALUE__) == FL_GPTIM_IC_POLARITY_INVERT))


#define IS_FL_GPTIM_IC_PSC(__VALUE__)               (((__VALUE__) == FL_GPTIM_IC_PSC_DIV1) \
                                                     || ((__VALUE__) == FL_GPTIM_IC_PSC_DIV2) \
                                                     || ((__VALUE__) == FL_GPTIM_IC_PSC_DIV4) \
                                                     || ((__VALUE__) == FL_GPTIM_IC_PSC_DIV8))

#define IS_FL_GPTIM_OC_POLARITY(__VALUE__)          (((__VALUE__) == FL_GPTIM_OC_POLARITY_NORMAL) \
                                                    || ((__VALUE__) == FL_GPTIM_OC_POLARITY_INVERT))

#define IS_FL_GPTIM_OC_MODE(__VALUE__)               (((__VALUE__) ==   FL_GPTIM_OC_MODE_FROZEN) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_ACTIVE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_INACTIVE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_TOGGLE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_FORCED_INACTIVE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_FORCED_ACTIVE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_PWM1) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_PWM2)\
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_RETRIG_OPM1)\
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_RETRIG_OPM2)\
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_COMBINED_PWM1)\
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_COMBINED_PWM2)\
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_ASSYMETRIC_PWM1)\
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_ASSYMETRIC_PWM2))

#define IS_FL_GPTIM_OC_FASTMODE(__VALUE__)          (((__VALUE__) == FL_ENABLE) \
                                                    || ((__VALUE__) == FL_DISABLE))

